stressTest/test.yaml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 5
      name: Warm up
    - duration: 120
      arrivalRate: 5
      rampTo: 50
      name: Ramp up load
    - duration: 600
      arrivalRate: 50
      rampTo: 100
      name: Sustained Load
    - duration: 120
      arrivalRate: 100
      name: Final Showdown
scenarios:
  - flow:
    - get:
        url: "/qa/questions?product_id=1&page=1&count=5"